export const AUTHOR_CASE = [
  {
    type: "image",
    src: "/avtor/138.webp",
    w: 1280,
    h: 788
  },
  {
    type: "image",
    src: "/avtor/139.webp",
    w: 1280,
    h: 789
  },
  {
    type: "image",
    src: "/avtor/140.webp",
    w: 1280,
    h: 834
  },
  {
    type: "image",
    src: "/avtor/141.webp",
    w: 1280,
    h: 777
  },
  {
    type: "image",
    src: "/avtor/142.webp",
    w: 1280,
    h: 784
  },
  {
    type: "image",
    src: "/avtor/143.webp",
    w: 1280,
    h: 779
  },
  {
    type: "image",
    src: "/avtor/144.webp",
    w: 1280,
    h: 780
  },
  {
    type: "image",
    src: "/avtor/145.webp",
    w: 1280,
    h: 788
  },
  {
    type: "image",
    src: "/avtor/146.webp",
    w: 1280,
    h: 788
  },
  {
    type: "image",
    src: "/avtor/147.webp",
    w: 1280,
    h: 811
  },
  {
    type: "image",
    src: "/avtor/148.webp",
    w: 620,
    h: 1280
  },
  {
    type: "text",
    text: "В указанном примере автор применяет следующие тактические мотивы:"
  },
  {
    type: "text",
    text: "Устранение защиты чёрного короля, Жертва, Освобождение поля"
  },
  {
    type: "text",
    text: "Динамические методы - Вскрытие диагоналей для атаки, Захват слабых полей, Создание перевеса в силах, Создание матовой сети"
  },
  {
    type: "image",
    src: "/avtor/149.webp",
    w: 1280,
    h: 828
  },
  {
    type: "image",
    src: "/avtor/150.webp",
    w: 1280,
    h: 829
  },
  {
    type: "summary"
  },
  {
    type: "text",
    text: "Скриншоты с диаграммами и комментариями поясняют способы динамики 1., 2., 3., выделенные жёлтым"
  },
  {
    type: "image",
    src: "/avtor/154.webp",
    w: 1280,
    h: 840
  },
  {
    type: "image",
    src: "/avtor/155.webp",
    w: 1280,
    h: 844
  },
  {
    type: "diagram",
    turn: "b",
    position: [
      [
        "",
        "",
        "♚",
        "♜",
        "",
        "",
        "♞",
        "♜"
      ],
      [
        "♕",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "♟",
        "",
        "",
        "♟",
        "♛",
        "♟",
        "♟"
      ],
      [
        "",
        "",
        "♟",
        "",
        "♝",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "♙",
        "♞",
        "♝",
        "",
        "",
        ""
      ],
      [
        "♘",
        "",
        "",
        "",
        "",
        "",
        "",
        "♘"
      ],
      [
        "♙",
        "♙",
        "",
        "♗",
        "",
        "♙",
        "♙",
        "♙"
      ],
      [
        "",
        "",
        "♔",
        "♖",
        "",
        "♗",
        "",
        "♖"
      ]
    ],
    steps: [
      {
        player: {
          from: [4, 3],
          to: [6, 4],
          beforeFen: "2kr2nr/Q7/1p2pqpp/2p1b3/2Pnb3/N6N/PP1B1PPP/2KR1B1R b - - 0 1"
        },
        reply: {
          from: [7, 5],
          to: [6, 4],
          beforeFen: "2kr2nr/Q7/1p2pqpp/2p1b3/2P1b3/N6N/PP1BnPPP/2KR1B1R w - - 1 2"
        }
      },
      {
        player: {
          from: [3, 4],
          to: [6, 1],
          beforeFen: "2kr2nr/Q7/1p2pqpp/2p1b3/2P1b3/N6N/PP1BBPPP/2KR3R b - - 0 2"
        },
        reply: null
      }
    ]
  },
  {
    type: "text",
    text: "Мы видим пять «активных фигур» чёрных, образующих «перевес в силах» в атаке на позицию белого короля, «рентген» (скрытая угроза) чёрного ферзя и слона, который вскрывается отскоком чёрного коня на поле e2, «матовую сеть», образованную двумя слонами чёрных, чёрная ладья с поля d8 оказывает «давление» на позицию короля белых, чёрный конь на поле d4, чёрный слон на поле e4 осуществили «захват» двух центральных полей - контроль центра является важнейшим элементом динамики, фигуры чёрных - Ферзь и два слона находятся на ударных позициях по диагоналям b1-h7, a1-h8, что в результате образует тактический мотив, направленный на слабый пункт белых - пешку b2 с неотразимой угрозой белому королю."
  },
  {
    type: "text",
    text: "Вот партия с юным американским вундеркиндом Гроссмейстером Энди Вудвордом в которой на 29-м ходу маэстро мог сдаться, но предпочёл играть на время…в итоге ничья."
  },
  {
    type: "text",
    text: "Блиц 3+0. Соавтор курса играет белыми фигурами. Здесь мы так же наблюдаем применение вышеизложенных принципов: белые пешки и ладья захватили четыре поля в лагере соперника, чёрным нечем ходить (!), решающее давление на слабость чёрных - пешку a6, с угрозой мата чёрному королю со стороны белого ферзя и ладьи с поля a1 заставляет чёрных отдать фигуру ходом пешки b6-b5. Позиция чёрных безнадёжна."
  },
  {
    type: "image",
    src: "/avtor/157.webp",
    w: 1280,
    h: 889
  },
  {
    type: "image",
    src: "/avtor/158.webp",
    w: 1280,
    h: 840
  },
  {
    type: "image",
    src: "/avtor/159.webp",
    w: 1280,
    h: 838
  },
  {
    type: "diagram",
    turn: "w",
    position: [
      [
        "",
        "",
        "♜",
        "",
        "♜",
        "",
        "",
        ""
      ],
      [
        "♚",
        "",
        "♟",
        "",
        "♛",
        "",
        "♟",
        ""
      ],
      [
        "♟",
        "♟",
        "♖",
        "",
        "",
        "",
        "",
        "♟"
      ],
      [
        "♙",
        "",
        "♝",
        "♙",
        "♙",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "♕",
        "",
        "",
        "♟",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "♘",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "♙",
        "♙"
      ],
      [
        "",
        "♖",
        "",
        "",
        "",
        "",
        "",
        "♔"
      ]
    ],
    steps: [
      {
        player: {
          from: [7, 1],
          to: [7, 0],
          beforeFen: "2r1r3/k1p1q1p1/ppR4p/P1bPP3/2Q2p2/5N2/6PP/1R5K w - - 0 1"
        },
        reply: {
          from: [2, 1],
          to: [3, 1],
          beforeFen: "2r1r3/k1p1q1p1/ppR4p/P1bPP3/2Q2p2/5N2/6PP/R6K b - - 1 1"
        }
      },
      {
        player: {
          from: [4, 2],
          to: [3, 2],
          beforeFen: "2r1r3/k1p1q1p1/p1R4p/PpbPP3/2Q2p2/5N2/6PP/R6K w - - 0 2"
        },
        reply: null
      }
    ]
  },
  {
    type: "image",
    src: "/avtor/161.webp",
    w: 1280,
    h: 845
  },
  {
    type: "text",
    text: "Создание матовой сети"
  },
  {
    type: "diagram",
    turn: "b",
    position: [
      [
        "♜",
        "",
        "",
        "",
        "",
        "♜",
        "",
        "♚"
      ],
      [
        "♟",
        "♟",
        "",
        "",
        "♛",
        "",
        "♟",
        "♟"
      ],
      [
        "",
        "",
        "",
        "♟",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "♗",
        "♟",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "♙",
        "",
        "",
        "",
        "♙",
        ""
      ],
      [
        "",
        "♙",
        "",
        "",
        "♝",
        "",
        "♟",
        ""
      ],
      [
        "♙",
        "♗",
        "",
        "",
        "♙",
        "",
        "",
        "♙"
      ],
      [
        "",
        "",
        "♖",
        "♕",
        "♖",
        "",
        "",
        "♔"
      ]
    ],
    steps: [
      {
        player: {
          from: [1, 4],
          to: [4, 7],
          beforeFen: "r4r1k/pp2q1pp/3p4/3Bp3/2P3P1/1P2b1p1/PB2P2P/2RQR2K b - - 0 1"
        },
        reply: null
      }
    ]
  },
  {
    type: "image",
    src: "/avtor/163.webp",
    w: 1280,
    h: 850
  },
  {
    type: "text",
    text: "Чёрные, которыми играет соавтор курса оставляют под боем своего ферзя, так как они используют тактический мотив - матовую сеть вокруг слабого короля. АВТОРЫ ОТНОСЯТ МАТОВУЮ СЕТЬ К ТАКТИЧЕСКИМ МОТИВАМ, КАК СПОСОБ ИСПОЛЬЗОВАНИЯ СЛАБОСТЕЙ, В ДАННОМ СЛУЧАЕ - ослабленная позиция белого короля, так же матовая сеть может являться способом ведения атаки на короля."
  },
  {
    type: "image",
    src: "/avtor/164.webp",
    w: 1280,
    h: 889
  },
  {
    type: "image",
    src: "/avtor/165.webp",
    w: 1280,
    h: 889
  },
  {
    type: "text",
    text: "Вот таким образом"
  },
  {
    type: "image",
    src: "/avtor/166.webp",
    w: 1280,
    h: 844
  },
  {
    type: "diagram",
    turn: "b",
    position: [
      [
        "",
        "",
        "♜",
        "",
        "",
        "♚",
        "",
        "♜"
      ],
      [
        "♟",
        "♕",
        "",
        "",
        "♗",
        "",
        "♟",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "♟",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "♛",
        "",
        "♞",
        "♟",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "♟",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "♙",
        "",
        "",
        "",
        "♙",
        ""
      ],
      [
        "♙",
        "♙",
        "",
        "",
        "",
        "♙",
        "♗",
        "♞"
      ],
      [
        "",
        "",
        "",
        "♖",
        "",
        "♖",
        "♔",
        ""
      ]
    ],
    steps: [
      {
        player: {
          from: [0, 5],
          to: [0, 6],
          beforeFen: "2r2k1r/pQ2B1p1/4p3/2q1np2/4p3/2P3P1/PP3PBn/3R1RK1 b - - 0 1"
        },
        reply: {
          from: [1, 4],
          to: [3, 2],
          beforeFen: "2r3kr/pQ2B1p1/4p3/2q1np2/4p3/2P3P1/PP3PBn/3R1RK1 w - - 1 2"
        }
      },
      {
        player: {
          from: [6, 7],
          to: [5, 5],
          beforeFen: "2r3kr/pQ4p1/4p3/2B1np2/4p3/2P3P1/PP3PBn/3R1RK1 b - - 0 2"
        },
        reply: {
          from: [6, 6],
          to: [5, 5],
          beforeFen: "2r3kr/pQ4p1/4p3/2B1np2/4p3/2P2nP1/PP3PB1/3R1RK1 w - - 1 3"
        }
      },
      {
        player: {
          from: [3, 4],
          to: [5, 5],
          beforeFen: "2r3kr/pQ4p1/4p3/2B1np2/4p3/2P2BP1/PP3P2/3R1RK1 b - - 0 3"
        },
        reply: {
          from: [7, 6],
          to: [6, 6],
          beforeFen: "2r3kr/pQ4p1/4p3/2B2p2/4p3/2P2nP1/PP3P2/3R1RK1 w - - 0 4"
        }
      },
      {
        player: {
          from: [0, 7],
          to: [6, 7],
          beforeFen: "2r3kr/pQ4p1/4p3/2B2p2/4p3/2P2nP1/PP3PK1/3R1R2 b - - 1 4"
        },
        reply: null
      }
    ]
  },
  {
    type: "text",
    text: "Ещё пример матовой атаки от соавтора курса"
  },
  {
    type: "text",
    text: "Яркий пример «перевеса в силах» в партии с международным мастером"
  },
  {
    type: "image",
    src: "/avtor/168.webp",
    w: 1280,
    h: 889
  },
  {
    type: "image",
    src: "/avtor/169.webp",
    w: 1280,
    h: 844
  },
  {
    type: "image",
    src: "/avtor/170.webp",
    w: 1280,
    h: 840
  },
  {
    type: "diagram",
    turn: "w",
    position: [
      [
        "",
        "♜",
        "♝",
        "",
        "",
        "♜",
        "♚",
        ""
      ],
      [
        "",
        "",
        "",
        "♞",
        "",
        "♟",
        "♝",
        ""
      ],
      [
        "♟",
        "",
        "",
        "",
        "",
        "",
        "♗",
        ""
      ],
      [
        "",
        "",
        "♛",
        "♘",
        "",
        "",
        "♘",
        ""
      ],
      [
        "",
        "",
        "♟",
        "",
        "",
        "",
        "",
        "♕"
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "♙"
      ],
      [
        "♙",
        "",
        "",
        "",
        "♟",
        "",
        "♙",
        ""
      ],
      [
        "♖",
        "",
        "",
        "",
        "",
        "♖",
        "♔",
        ""
      ]
    ],
    steps: [
      {
        player: {
          from: [7, 6],
          to: [7, 7],
          beforeFen: "1rb2rk1/3n1pb1/p5B1/2qN2N1/2p4Q/7P/P3p1P1/R4RK1 w - - 0 1"
        },
        reply: {
          from: [6, 4],
          to: [7, 5],
          beforeFen: "1rb2rk1/3n1pb1/p5B1/2qN2N1/2p4Q/7P/P3p1P1/R4R1K b - - 1 1"
        }
      },
      {
        player: {
          from: [7, 0],
          to: [7, 5],
          beforeFen: "1rb2rk1/3n1pb1/p5B1/2qN2N1/2p4Q/7P/P5P1/R4q1K w - - 0 2"
        },
        reply: {
          from: [0, 5],
          to: [0, 4],
          beforeFen: "1rb2rk1/3n1pb1/p5B1/2qN2N1/2p4Q/7P/P5P1/5R1K b - - 0 2"
        }
      },
      {
        player: {
          from: [4, 7],
          to: [1, 7],
          beforeFen: "1rb1r1k1/3n1pb1/p5B1/2qN2N1/2p4Q/7P/P5P1/5R1K w - - 1 3"
        },
        reply: {
          from: [0, 6],
          to: [0, 5],
          beforeFen: "1rb1r1k1/3n1pbQ/p5B1/2qN2N1/2p5/7P/P5P1/5R1K b - - 2 3"
        }
      },
      {
        player: {
          from: [7, 5],
          to: [1, 5],
          beforeFen: "1rb1rk2/3n1pbQ/p5B1/2qN2N1/2p5/7P/P5P1/5R1K w - - 3 4"
        },
        reply: null
      }
    ]
  },
  {
    type: "text",
    text: "Ещё пример победы над мастером с помощью решающего давления тяжёлых фигур чёрных (две ладьи, ферзь) по вертикали g с применением тактического мотива - «устранение защиты» с помощью удара коня на поле g3."
  },
  {
    type: "image",
    src: "/avtor/172.webp",
    w: 1280,
    h: 844
  },
  {
    type: "image",
    src: "/avtor/173.webp",
    w: 1280,
    h: 854
  },
  {
    type: "image",
    src: "/avtor/174.webp",
    w: 1280,
    h: 853
  },
  {
    type: "image",
    src: "/avtor/175.webp",
    w: 1280,
    h: 844
  },
  {
    type: "diagram",
    turn: "b",
    position: [
      [
        "",
        "",
        "",
        "",
        "",
        "",
        "♜",
        "♚"
      ],
      [
        "♟",
        "♟",
        "",
        "",
        "",
        "",
        "♛",
        "♟"
      ],
      [
        "",
        "",
        "♟",
        "",
        "♟",
        "♞",
        "",
        ""
      ],
      [
        "",
        "",
        "♙",
        "♟",
        "♘",
        "♟",
        "♜",
        "♞"
      ],
      [
        "",
        "",
        "",
        "♙",
        "",
        "",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "",
        "♙",
        "♙",
        "",
        ""
      ],
      [
        "♙",
        "♙",
        "",
        "",
        "",
        "♕",
        "♗",
        "♙"
      ],
      [
        "♖",
        "",
        "",
        "",
        "",
        "",
        "♖",
        "♔"
      ]
    ],
    steps: [
      {
        player: {
          from: [3, 7],
          to: [5, 6],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNprn/3P4/4PP2/PP3QBP/R5RK b - - 0 1"
        },
        reply: {
          from: [6, 7],
          to: [5, 6],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNpr1/3P4/4PPn1/PP3QBP/R5RK w - - 1 2"
        }
      },
      {
        player: {
          from: [3, 6],
          to: [3, 7],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNpr1/3P4/4PPP1/PP3QB1/R5RK b - - 0 2"
        },
        reply: {
          from: [6, 6],
          to: [5, 7],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp1r/3P4/4PPP1/PP3QB1/R5RK w - - 1 3"
        }
      },
      {
        player: {
          from: [3, 7],
          to: [5, 7],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp1r/3P4/4PPPB/PP3Q2/R5RK b - - 2 3"
        },
        reply: {
          from: [7, 7],
          to: [6, 6],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp2/3P4/4PPPr/PP3Q2/R5RK w - - 0 4"
        }
      },
      {
        player: {
          from: [5, 7],
          to: [5, 6],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp2/3P4/4PPPr/PP3QK1/R5R1 b - - 1 4"
        },
        reply: {
          from: [6, 6],
          to: [7, 5],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp2/3P4/4PPr1/PP3QK1/R5R1 w - - 0 5"
        }
      },
      {
        player: {
          from: [5, 6],
          to: [7, 6],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp2/3P4/4PPr1/PP3Q2/R4KR1 b - - 1 5"
        },
        reply: {
          from: [7, 5],
          to: [6, 4],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp2/3P4/4PP2/PP3Q2/R4Kr1 w - - 0 6"
        }
      },
      {
        player: {
          from: [7, 6],
          to: [6, 6],
          beforeFen: "6rk/pp4qp/2p1pn2/2PpNp2/3P4/4PP2/PP2KQ2/R5r1 b - - 1 6"
        },
        reply: null
      }
    ]
  },
  {
    type: "text",
    text: "В следующем примере в игре с титулованным соперником соавтор (белые) использует тактические мотивы - Связка, Отвлечение, Жертва, Устранение защиты, Матовая сеть"
  },
  {
    type: "image",
    src: "/avtor/177.webp",
    w: 1280,
    h: 843
  },
  {
    type: "image",
    src: "/avtor/178.webp",
    w: 1280,
    h: 889
  },
  {
    type: "text",
    text: "Если взять белую ладью на поле b7, то белый ферзь даёт шах на поле e8 и следующим ходом даёт мат на поле f8 после единственного отхода чёрным ферзём на поле f8"
  },
  {
    type: "image",
    src: "/avtor/179.webp",
    w: 1280,
    h: 889
  },
  {
    type: "text",
    text: "Если взять белого слона чёрным слоном на поле f6, то вскрывается «рентген» и белый ферзь даёт мат на поле h7. Сразу ПЯТЬ тактических мотивов в одной позиции! Это блиц 3+0. Умение быстро видеть и применять тактические мотивы - важный навык динамического мастерства, которым обладает соавтор курса и пытается передать его Вам, уважаемые пользователи. Курс ценен тем, что составлен на основе материала из онлайн практики соавтора, который он понял и прочувствовал непосредственно в практической игре с высококвалифицированными игроками."
  },
  {
    type: "image",
    src: "/avtor/180.webp",
    w: 1280,
    h: 889
  },
  {
    type: "text",
    text: "Дальнейшее понятно без комментариев"
  },
  {
    type: "image",
    src: "/avtor/181.webp",
    w: 1280,
    h: 846
  },
  {
    type: "image",
    src: "/avtor/182.webp",
    w: 1280,
    h: 842
  },
  {
    type: "diagram",
    turn: "w",
    position: [
      [
        "",
        "♜",
        "",
        "",
        "",
        "",
        "",
        "♚"
      ],
      [
        "♟",
        "♖",
        "",
        "",
        "",
        "",
        "♝",
        "♟"
      ],
      [
        "",
        "",
        "♟",
        "♛",
        "♟",
        "♟",
        "",
        ""
      ],
      [
        "",
        "",
        "",
        "♟",
        "",
        "♟",
        "",
        "♕"
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "♙",
        "",
        "♗"
      ],
      [
        "",
        "",
        "♙",
        "",
        "♙",
        "",
        "",
        ""
      ],
      [
        "♙",
        "",
        "",
        "♜",
        "",
        "",
        "♙",
        "♙"
      ],
      [
        "",
        "",
        "",
        "",
        "",
        "♖",
        "♔",
        ""
      ]
    ],
    steps: [
      {
        player: {
          from: [4, 7],
          to: [2, 5],
          beforeFen: "1r5k/pR4bp/2pqpp2/3p1p1Q/5P1B/2P1P3/P2r2PP/5RK1 w - - 0 1"
        },
        reply: {
          from: [0, 1],
          to: [0, 6],
          beforeFen: "1r5k/pR4bp/2pqpB2/3p1p1Q/5P2/2P1P3/P2r2PP/5RK1 b - - 0 1"
        }
      },
      {
        player: {
          from: [1, 1],
          to: [1, 6],
          beforeFen: "6rk/pR4bp/2pqpB2/3p1p1Q/5P2/2P1P3/P2r2PP/5RK1 w - - 1 2"
        },
        reply: {
          from: [0, 6],
          to: [1, 6],
          beforeFen: "6rk/p5Rp/2pqpB2/3p1p1Q/5P2/2P1P3/P2r2PP/5RK1 b - - 0 2"
        }
      },
      {
        player: {
          from: [3, 7],
          to: [0, 4],
          beforeFen: "7k/p5rp/2pqpB2/3p1p1Q/5P2/2P1P3/P2r2PP/5RK1 w - - 0 3"
        },
        reply: {
          from: [2, 3],
          to: [0, 5],
          beforeFen: "4Q2k/p5rp/2pqpB2/3p1p2/5P2/2P1P3/P2r2PP/5RK1 b - - 1 3"
        }
      },
      {
        player: {
          from: [0, 4],
          to: [0, 5],
          beforeFen: "4Qq1k/p5rp/2p1pB2/3p1p2/5P2/2P1P3/P2r2PP/5RK1 w - - 2 4"
        },
        reply: null
      }
    ]
  }
];
